#include "Init.h"

void init(void)
{
Motor_Init();     //电机初始化
Encoder_Init();   //编码器初始化
imu660rb_init();  //姿态传感器初始化
pit_hanlder1 ();
}



//-------------------------------------------------------------------------------------------------------------------
// 函数简介     PIT 的中断处理函数 这个函数将在 PIT 对应的定时器中断调用 
// 参数说明     void
// 返回参数     void
// 使用示例     pit_hanlder();
//-------------------------------------------------------------------------------------------------------------------
void pit_hanlder1 (void)
{
Encoder_data_get();
	
	//    imu660rb_get_acc();                                                         // 获取 IMU660RB 的加速度测量数值
//    imu660rb_get_gyro();                                                        // 获取 IMU660RB 的角速度测量数值
}